app/views/cuisine_types/index.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."cuisine_type_id" = ?  [["cuisine_type_id", 1]]
---
			<td><ul>
				<% cuisine.restaurants.each do |restaurant| %>