app/views/restaurants/_form.html.erb

SELECT "cuisine_types".* FROM "cuisine_types"
---
    <%= f.label "Cuisine Type" %><br>
    <%= f.collection_select(:cuisine_type_id, CuisineType.all, :id, :name) %>