app/views/restaurants/show.html.erb


<% @restaurant.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE (restaurant_id = 8 and reserved_at > '2015-11-16 18:00:00.000000' and reserved_at < '2015-11-16 18:59:59.999999')