app/controllers/cuisine_types_controller.rb

	def index
		@cuisine_types = CuisineType.all
---
SELECT "cuisine_types".* FROM "cuisine_types"