app/controllers/reservations_controller.rb

   def create
      @restaurant = Restaurant.find(params[:restaurant_id])
      @reservation = Reservation.new(sanitized_reservation_params)
      @reservation.restaurant_id = @restaurant.id
      #@reservation = @restaurant.reservations.build(sanitized_reservation_params)

      if @reservation.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "reservations" ("party_size", "reserved_at", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["party_size", 3], ["reserved_at", "2015-09-16 21:40:00.000000"], ["restaurant_id", 6], ["created_at", "2015-09-16 17:50:44.663270"], ["updated_at", "2015-09-16 17:50:44.663270"]]