app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
	def index
		@restaurants = Restaurant.all

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 3]]
---
	def edit
		@restaurant = Restaurant.find(params[:id])

INSERT INTO "restaurants" ("name", "address", "capacity", "cuisine_type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Johnny Rockets"], ["address", "11 5th Avenue"], ["capacity", 123], ["cuisine_type_id", 2], ["created_at", "2015-09-11 00:51:45.177553"], ["updated_at", "2015-09-11 00:51:45.177553"]]
---
	def create
		@restaurant = Restaurant.new(restaurant_params)
		if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "restaurants" SET "city" = ?, "postal_code" = ?, "phone_number" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["city", "Seoul"], ["postal_code", "L5C2D8"], ["phone_number", "2269298728"], ["updated_at", "2015-09-11 01:37:12.632030"], ["id", 14]]
---
	def update
		@restaurant = Restaurant.find(params[:id])

		if @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 2]]
---
	def destroy
		@restaurant = Restaurant.find(params[:id])
		@restaurant.destroy